Repository: hakanerguul/ft_transcendence
Catalog: srcs/requirements/main/locale/*/LC_MESSAGES/django.po
Languages: it

source: Email "{}" is already in use.
it: L'indirizzo email "{}" è già in uso.

source: Username "{}" is already in use.
it: Il nome utente "{}" è già in uso.

source: Invalid login
it: Accesso non valido

source: Users must have an email address.
it: Gli utenti devono avere un indirizzo email.

source: Users must have an username.
it: Gli utenti devono avere un nome utente.

source: Users must have an first name.
it: Gli utenti devono avere un nome.

source: Users must have an last name.
it: Gli utenti devono avere un cognome.

source: This user hidden his email
it: Questo utente ha nascosto la sua email

source: Username
it: Nome utente

source: First Name
it: Nome

source: Last Name
it: Cognome

source: Update
it: Aggiorna

source: Change password
it: Cambia password

source: Accept Friend Request
it: Accetta richiesta di amicizia

source: Cancel Friend Request
it: Annulla richiesta di amicizia

source: Send Friend Request
it: Invia richiesta di amicizia

source: Block this user
it: Blocca questo utente

source: Unfriend
it: Non essere più amici

source: Friends
it: Amici

source: Friend Request
it: Richiesta di amicizia

source: Friend Requests
it: Richieste di amicizia

source: Close
it: Chiudi

source: Message
it: Messaggio

source: Unblock this user
it: Sblocca questo utente

source: Edit Account
it: Modifica Account

source: Edit
it: Modifica

source: Email address
it: Indirizzo email

source: Hide Email
it: Nascondi Email

source: Save
it: Salva

source: Back
it: Indietro

source: Users
it: Gli utenti

source: Status
it: Stato

source: Login
it: Accesso

source: Reset password
it: Resetta password

source: Register
it: Registrati

source: Confirm password
it: Conferma password

source: Search
it: Cerca

source: Send a Message
it: Invia un messaggio

source: Not Friends
it: Non Amici

source: This is you
it: Questo sei tu

source: No results
it: Nessun risultato

source: awhile ago
it: un po' di tempo fa

source: day(s) ago
it: giorno(i) fa

source: hour(s) ago
it: ora(e) fa

source: minute(s) ago
it: minuto(i) fa

source: second(s) ago
it: secondo(i) fa

source: User does not exist
it: L'utente non esiste

source: You are blocked by this {} user.
it: Sei bloccato da questo utente {}.

source: Invalid query
it: Query non valida

source: something went wrong
it: Qualcosa è andato storto

source: You cannot edit this account
it: Non è possibile modificare questo account

source: You can't send an empty message.
it: Non puoi inviare un messaggio vuoto.

source: Something went wrong retrieving the chatroom messages.
it: Qualcosa è andato storto durante il recupero dei messaggi della chat.

source: Something went wrong retrieving the other users account details.
it: Qualcosa è andato storto durante il recupero dei dettagli dell'account degli altri utenti.

source: EXCEPTION:
it: ECCEZIONE:

source: ROOM_ACCESS_DENIED
it: ACCESSO_SALA_NEGATO

source: Room access denied
it: Accesso alla sala negato

source: ROOM_INVALID
it: SALA_NON_VALIDA

source: Invalid room.
it: Sala non valida.

source: You do not have permission to join this room.
it: Non hai il permesso per unirti a questa sala.

source: You must be friends to chat.
it: Devi essere amici per chattare.

source: DATA_ERROR
it: ERRORE_DATI

source: Unable to get that users information.
it: Impossibile ottenere le informazioni degli utenti.

source: ClientError(code = {}, message = {})
it: ErroreCliente(codice = {}, messaggio = {})

source: Loading
it: Caricamento

source: Type your message
it: Scrivi il tuo messaggio

source: Send
it: Invia

source: No message your friends
it: Nessun messaggio ai tuoi amici

source: Socket Client Error
it: Errore Client Socket

source: Something went wrong.
it: Qualcosa è andato storto.

source: Successfully.
it: Operazione completata.

source: Error
it: Errore

source: Friend object not found for user: {}
it: Oggetto amico non trovato per l'utente: {}

source: Unable to start a chat with that user.
it: Impossibile avviare una chat con quell'utente.

source: Invalid request method.
it: Metodo di richiesta non valido.

source: You can't start a chat if you are not authenticated.
it: Non puoi avviare una chat se non sei autenticato.

source: Friend List
it: Lista amici

source: No friends
it: Nessun amico

source: Not found user id
it: ID utente non trovato

source: Friend request accepted.
it: Richiesta di amicizia accettata.

source: Successfully blocked user.
it: Utente bloccato con successo.

source: Friend request canceled.
it: Richiesta di amicizia annullata.

source: Friend request declined.
it: Richiesta di amicizia declinata.

source: Successfully removed friend.
it: Amico rimosso con successo.

source: Friend request sent.
it: Richiesta di amicizia inviata.

source: Successfully unblocked user.
it: Utente sbloccato con successo.

source: U can't view another users friend requests.
it: Non puoi visualizzare le richieste di amicizia di un altro utente.

source: U already sent them a friend request.
it: Hai già inviato una richiesta di amicizia a loro.

source: Unable to send a friend request.
it: Impossibile inviare una richiesta di amicizia.

source: U must be authenticated to send a friend request.
it: Devi essere autenticato per inviare una richiesta di amicizia.

source: That is not your friend request.
it: Questa non è la tua richiesta di amicizia.

source: Something went wrong {}
it: Qualcosa è andato storto {}

source: There was an error. Unable to remove that friend.
it: Si è verificato un errore. Impossibile rimuovere quell'amico.

source: U must be authenticated to remove a friend.
it: Devi essere autenticato per rimuovere un amico.

source: There was an error. Unable to block that user.
it: Si è verificato un errore. Impossibile bloccare quell'utente.

source: You must be authenticated to block a user.
it: Devi essere autenticato per bloccare un utente.

source: There was an error. Unable to unblock that user.
it: Si è verificato un errore. Impossibile sbloccare quell'utente.

source: You must be authenticated to unblock a user.
it: Devi essere autenticato per sbloccare un utente.

source: That is not your friend request to decline.
it: Questa non è la tua richiesta di amicizia da declinare.

source: Unable to decline friend request.
it: Impossibile declinare la richiesta di amicizia.

source: U must be authenticated.
it: Devi essere autenticato.

source: Nothing to cancel. Friend request does not exist.
it: Nulla da annullare. La richiesta di amicizia non esiste.

source: Unable to cancel that friend request.
it: Impossibile annullare quella richiesta di amicizia.

source: You must be authenticated to cancel a friend request.
it: Devi essere autenticato per annullare una richiesta di amicizia.

source: That user does not exist.
it: Quell'utente non esiste.

source: Could not find a friends list for {}
it: Impossibile trovare una lista amici per {}

source: You must be friends to view their friends list.
it: Devi essere amici per visualizzare la loro lista amici.

source: German
it: Tedesco

source: English
it: Inglese

source: French
it: Francese

source: Italian
it: Italiano

source: Turkish
it: Turco

source: Difficulty Settings
it: Impostazioni di difficoltà

source: Color Settings
it: Impostazioni colore

source: Ball Speed Settings
it: Impostazioni velocità palla

source: Difficulty Level
it: Livello di difficoltà

source: Easy
it: Facile

source: Medium
it: Medio

source: Hard
it: Difficile

source: Player Color
it: Colore giocatore

source: AI Color
it: Colore IA

source: Apply
it: Applica

source: Ball Speed
it: Velocità palla

source: Pong Home
it: Home di Pong

source: Hello
it: Ciao

source: Room Name
it: Nome della stanza

source: Enter the name of the room to create
it: Inserisci il nome della stanza da creare

source: Start the Game
it: Inizia il gioco

source: Game History Table
it: Tabella cronologia partite

source: Play Tournaments
it: Gioca Tornei

source: Play with Ai
it: Gioca con l'IA

source: Play with Offline
it: Giocare con l'offline

source: Creator
it: Creatore

source: Is Over
it: È finito

source: Game History
it: Cronologia partite

source: Game Home
it: Home di gioco

source: Player 1
it: Giocatore 1

source: Player 2
it: Giocatore 2

source: Winner
it: Vincitore

source: Game State
it: Stato della partita

source: Waiting for Player
it: In attesa del giocatore

source: Continues
it: Continua

source: Over
it: Finito

source: Change Racket Color
it: Cambia colore racchetta

source: Offline Game
it: Gioco offline

source: Try Again
it: Riprova

source: Reset
it: Resettare

source: Settings
it: Impostazioni

source: Player 1 Racket Color:
it: Giocatore 1 Colore della racchetta:

source: Player 2 Racket Color:
it: Giocatore 2 Colore della racchetta:

source: Color of the Ball:
it: Colore della palla:

source: Ball Speed:
it: Velocità palla:

source: Tournament
it: Torneo

source: Player 1 Nickname
it: Nickname Giocatore 1

source: Player 2 Nickname
it: Nickname Giocatore 2

source: Player 3 Nickname
it: Nickname Giocatore 3

source: Start the Final Game
it: Inizia la partita finale

source: You Won!
it: Hai vinto!

source: You Lost!
it: Hai perso!

source: Please enter a room name.
it: Inserisci il nome della stanza.

source: You
it: Tu

source: Finished
it: Finito

source: Join
it: Unisciti

source: Player Pending
it: Giocatore in attesa

source: Failed to update winner:
it: Impossibile aggiornare il vincitore:

source: Error updating winner:
it: Errore durante l'aggiornamento del vincitore:

source: Please Attention: Enter the names of the players!
it: Attenzione: inserisci il nome dei giocatori!

source: Semi-Final Winner:
it: Vincitore Semifinale:

source: Next match:
it: Prossima partita:

source: Winner:
it: Vincitore:

source: room information not available room name {}
it: informazioni sulla stanza non disponibili nome stanza {}

source: The room is already full or finish
it: La stanza è già piena o finita

source: The room does not exist
it: La stanza non esiste

source: Invalid request method
it: Metodo di richiesta non valido

source: Page not found
it: Pagina non trovata

source: Sorry, the page you are looking for does not exist.
it: Spiacenti, la pagina che stai cercando non esiste.

source: Language
it: Lingua

source: Logout
it: Disconnettersi

source: Sign Up
it: Registrati

source: Password Change
it: Modifica password

source: Old password
it: Vecchia password

source: New password
it: Nuova password

source: Password Change Done
it: Modifica password completata

source: Your password has been Updated.
it: La tua password è stata aggiornata.

source: Password Reset Complete
it: Reset password completato

source: Your password has been reset.
it: La tua password è stata reimpostata.

source: You may go ahead and
it: Puoi procedere e

source: log in
it: accedere

source: Password Reset Done
it: Reset password completato

source: We've emailed you instructions for setting your password, if an account exists with the email you entered.
it: Ti abbiamo inviato per email le istruzioni per impostare la tua password, se un account esiste con l'email che hai inserito.

source: You should receive them shortly.
it: Dovresti riceverle a breve.

source: If you don't receive an email, please make sure you've entered the address you registered with, and check your spam folder.
it: Se non ricevi l'email, assicurati di aver inserito l'indirizzo con cui ti sei registrato e controlla la cartella spam.

source: Return to home page
it: Torna alla pagina iniziale

source: You're receiving this email because you requested a password reset for your user account at %(site_name)s.
it: Ricevi questa email perché hai richiesto un reset della password per il tuo account utente su %(site_name)s.

source: Please go to the following page and choose a new password:
it: Vai alla seguente pagina e scegli una nuova password:

source: Your username, in case you’ve forgotten:
it: Il tuo nome utente, nel caso l'abbia dimenticato:

source: This link will expire in 1 days.
it: Questo link scadrà in 1 giorno.

source: Thanks for using our site!
it: Grazie per aver utilizzato il nostro sito!

source: Transformers Team
it: Il team di Transformers

source: Password Reset
it: Reset password

source: Send reset email
it: Invia email di reset

source: The connection closed unexpectedly.
it: La connessione si è chiusa inaspettatamente.

source: Connection closed successfully.
it: Connessione chiusa con successo.

source: Connection closed. Code: {close_code}
it: Connessione chiusa. Codice: {close_code}

source: PLAY
it: GIOCA

source: Choose Option
it: Scegli opzione

source: Create Room Code
it: Crea codice stanza

source: Have Room Code
it: Hai un codice stanza

source: Enter Room Code
it: Inserisci codice stanza

source: Type room code
it: Digita il codice della stanza

source: Start Game
it: Inizia gioco

source: Room code
it: Codice stanza

source: Date Played
it: Data di gioco

source: Good job! You won.
it: Bravo! Hai vinto.

source: Sorry! You lost
it: Mi dispiace! Hai perso.

source: Game over! No one won.
it: Partita finita! Nessuno ha vinto.

source: It is your turn
it: E' il tuo turno

source: Now
it: Ora

source: The room is already full
it: La stanza è già piena
